models/Customer.php

UPDATE `tbl_customer` SET `status`='Online' WHERE `id`=3
---
    public function onlineCustomer($user){


	      $post = Customer::find()->select("*")->where(array('user' => $user))->one();
              if($post->status){

                  $post->status = "Online";
	          $post->save();